[
  {
    "title": "LaM-SLidE: Latent Space Modeling of Spatial Dynamical Systems via Linked\n  Entities",
    "authors": "Florian Sestak, Artur Toshev, Andreas Fürst, Günter Klambauer, Andreas Mayr, Johannes Brandstetter",
    "summary": "Generative models are spearheading recent progress in deep learning, showing\nstrong promise for trajectory sampling in dynamical systems as well. However,\nwhile latent space modeling paradigms have transformed image and video\ngeneration, similar approaches are more difficult for most dynamical systems.\nSuch systems -- from chemical molecule structures to collective human behavior\n-- are described by interactions of entities, making them inherently linked to\nconnectivity patterns and the traceability of entities over time. Our approach,\nLaM-SLidE (Latent Space Modeling of Spatial Dynamical Systems via Linked\nEntities), combines the advantages of graph neural networks, i.e., the\ntraceability of entities across time-steps, with the efficiency and scalability\nof recent advances in image and video generation, where pre-trained encoder and\ndecoder are frozen to enable generative modeling in the latent space. The core\nidea of LaM-SLidE is to introduce identifier representations (IDs) to allow for\nretrieval of entity properties, e.g., entity coordinates, from latent system\nrepresentations and thus enables traceability. Experimentally, across different\ndomains, we show that LaM-SLidE performs favorably in terms of speed, accuracy,\nand generalizability. (Code is available at\nhttps://github.com/ml-jku/LaM-SLidE)",
    "published": "2025-02-17T18:49:13Z",
    "pdf_link": "http://arxiv.org/pdf/2502.12128v1"
  },
  {
    "title": "Data assimilation performed with robust shape registration and graph\n  neural networks: application to aortic coarctation",
    "authors": "Francesco Romor, Felipe Galarce, Jan Brüning, Leonid Goubergrits, Alfonso Caiazzo",
    "summary": "Image-based, patient-specific modelling of hemodynamics can improve\ndiagnostic capabilities and provide complementary insights to better understand\nthe hemodynamic treatment outcomes. However, computational fluid dynamics\nsimulations remain relatively costly in a clinical context. Moreover,\nprojection-based reduced-order models and purely data-driven surrogate models\nstruggle due to the high variability of anatomical shapes in a population. A\npossible solution is shape registration: a reference template geometry is\ndesigned from a cohort of available geometries, which can then be\ndiffeomorphically mapped onto it. This provides a natural encoding that can be\nexploited by machine learning architectures and, at the same time, a reference\ncomputational domain in which efficient dimension-reduction strategies can be\nperformed. We compare state-of-the-art graph neural network models with recent\ndata assimilation strategies for the prediction of physical quantities and\nclinically relevant biomarkers in the context of aortic coarctation.",
    "published": "2025-02-17T18:15:09Z",
    "pdf_link": "http://arxiv.org/pdf/2502.12097v1"
  },
  {
    "title": "Unifying Explainable Anomaly Detection and Root Cause Analysis in\n  Dynamical Systems",
    "authors": "Yue Sun, Rick S. Blum, Parv Venkitasubramaniam",
    "summary": "Dynamical systems, prevalent in various scientific and engineering domains,\nare susceptible to anomalies that can significantly impact their performance\nand reliability. This paper addresses the critical challenges of anomaly\ndetection, root cause localization, and anomaly type classification in\ndynamical systems governed by ordinary differential equations (ODEs). We define\ntwo categories of anomalies: cyber anomalies, which propagate through\ninterconnected variables, and measurement anomalies, which remain localized to\nindividual variables. To address these challenges, we propose the Interpretable\nCausality Ordinary Differential Equation (ICODE) Networks, a model-intrinsic\nexplainable learning framework. ICODE leverages Neural ODEs for anomaly\ndetection while employing causality inference through an explanation channel to\nperform root cause analysis (RCA), elucidating why specific time periods are\nflagged as anomalous. ICODE is designed to simultaneously perform anomaly\ndetection, RCA, and anomaly type classification within a single, interpretable\nframework. Our approach is grounded in the hypothesis that anomalies alter the\nunderlying ODEs of the system, manifesting as changes in causal relationships\nbetween variables. We provide a theoretical analysis of how perturbations in\nlearned model parameters can be utilized to identify anomalies and their root\ncauses in time series data. Comprehensive experimental evaluations demonstrate\nthe efficacy of ICODE across various dynamical systems, showcasing its ability\nto accurately detect anomalies, classify their types, and pinpoint their\norigins.",
    "published": "2025-02-17T18:01:07Z",
    "pdf_link": "http://arxiv.org/pdf/2502.12086v1"
  },
  {
    "title": "Unsupervised Structural-Counterfactual Generation under Domain Shift",
    "authors": "Krishn Vishwas Kher, Lokesh Venkata Siva Maruthi Badisa, Kusampudi Venkata Datta Sri Harsha, Chitneedi Geetha Sowmya, SakethaNath Jagarlapudi",
    "summary": "Motivated by the burgeoning interest in cross-domain learning, we present a\nnovel generative modeling challenge: generating counterfactual samples in a\ntarget domain based on factual observations from a source domain. Our approach\noperates within an unsupervised paradigm devoid of parallel or joint datasets,\nrelying exclusively on distinct observational samples and causal graphs for\neach domain. This setting presents challenges that surpass those of\nconventional counterfactual generation. Central to our methodology is the\ndisambiguation of exogenous causes into effect-intrinsic and domain-intrinsic\ncategories. This differentiation facilitates the integration of domain-specific\ncausal graphs into a unified joint causal graph via shared effect-intrinsic\nexogenous variables. We propose leveraging Neural Causal models within this\njoint framework to enable accurate counterfactual generation under standard\nidentifiability assumptions. Furthermore, we introduce a novel loss function\nthat effectively segregates effect-intrinsic from domain-intrinsic variables\nduring model training. Given a factual observation, our framework combines the\nposterior distribution of effect-intrinsic variables from the source domain\nwith the prior distribution of domain-intrinsic variables from the target\ndomain to synthesize the desired counterfactuals, adhering to Pearl's causal\nhierarchy. Intriguingly, when domain shifts are restricted to alterations in\ncausal mechanisms without accompanying covariate shifts, our training regimen\nparallels the resolution of a conditional optimal transport problem. Empirical\nevaluations on a synthetic dataset show that our framework generates\ncounterfactuals in the target domain that very closely resemble the ground\ntruth.",
    "published": "2025-02-17T16:48:16Z",
    "pdf_link": "http://arxiv.org/pdf/2502.12013v1"
  },
  {
    "title": "Blank Space: Adaptive Causal Coding for Streaming Communications Over\n  Multi-Hop Networks",
    "authors": "Adina Waxman, Shai Ginzach, Aviel Glam, Alejandro Cohen",
    "summary": "In this work, we introduce Blank Space AC-RLNC (BS), a novel Adaptive and\nCausal Network Coding (AC-RLNC) solution designed to mitigate the triplet\ntrade-off between throughput-delay-efficiency in multi-hop networks. BS\nleverages the network's physical limitations considering the bottleneck from\neach node to the destination. In particular, BS introduces a\nlight-computational re-encoding algorithm, called Network AC-RLNC (NET),\nimplemented independently at intermediate nodes. NET adaptively adjusts the\nForward Error Correction (FEC) rates and schedules idle periods. It\nincorporates two distinct suspension mechanisms: 1) Blank Space Period,\naccounting for the forward-channels bottleneck, and 2) No-New No-FEC approach,\nbased on data availability. The experimental results achieve significant\nimprovements in resource efficiency, demonstrating a 20% reduction in channel\nusage compared to baseline RLNC solutions. Notably, these efficiency gains are\nachieved while maintaining competitive throughput and delay performance,\nensuring improved resource utilization does not compromise network performance.",
    "published": "2025-02-17T16:25:19Z",
    "pdf_link": "http://arxiv.org/pdf/2502.11984v1"
  },
  {
    "title": "Noncontextual ontological models of operational probabilistic theories",
    "authors": "Sina Soltani, Marco Erba, David Schmid, John H. Selby",
    "summary": "An experiment or theory is classically explainable if it can be reproduced by\nsome noncontextual ontological model. In this work, we adapt the notion of\nontological models and generalized noncontextuality so it applies to the\nframework of operational probabilistic theories (OPTs). A defining feature of\nquotiented OPTs, which sets them apart from the closely related framework of\ngeneralized probabilistic theories (GPTs), is their explicit specification of\nthe structure of instruments, these being generalizations of $\\textit{quantum\ninstruments}$ (including nondestructive measurements); in particular, one needs\nto explicitly declare which collections of transformations constitute a valid\ninstrument. We are particularly interested in strongly causal OPTs, in which\nthe choice of a future instrument can be conditioned on a past measurement\noutcome. This instrument structure might seem to permit the possibility of a\ncontextual kind of ontological representation, where the representation of a\ngiven transformation depends on which instrument it is considered a part of.\nHowever, we prove that this is not possible by showing that for strongly causal\nquotiented OPTs the structure of instruments does $\\textit{not}$ allow for such\na contextual ontological representation. It follows that ontological\nrepresentations of strongly causal quotiented OPTs are entirely determined by\ntheir action on individual transformations, with no dependence on the structure\nof instruments.",
    "published": "2025-02-17T14:36:37Z",
    "pdf_link": "http://arxiv.org/pdf/2502.11842v1"
  },
  {
    "title": "A Diagnostic to Find and Help Combat Positivity Issues - with a Focus on\n  Continuous Treatments",
    "authors": "Katharina Ring, Michael Schomaker",
    "summary": "The positivity assumption is central in the identification of a causal\neffect, yet is rarely discussed, especially in conjunction with continuous\ntreatments or Modified Treatment Policies. One common recommendation for\ndealing with a violation is to change the estimand. However, an applied\nresearcher is faced with two problems: First, how can she tell whether there is\na positivity violation given her estimand of interest, preferably without\nhaving to estimate a model first? Second, if she finds a problem with\npositivity, how should she change her estimand in order to arrive at an\nestimand which does not face the same issues? We suggest a novel diagnostic\nwhich allows the researcher to answer both questions by providing insights into\nhow well an estimation for a certain estimand can be made for each observation\nusing the data at hand. We provide a simulation study on the general behaviour\nof different MTPs at different levels of positivity violations and show how the\ndiagnostic helps understand where bias is to be expected. We illustrate the\napplication of our proposed diagnostic in a pharmacoepidemiological study based\non data from CHAPAS-3, a trial comparing different treatment regimens for\nchildren living with HIV.",
    "published": "2025-02-17T14:13:09Z",
    "pdf_link": "http://arxiv.org/pdf/2502.11820v1"
  },
  {
    "title": "Exploring Translation Mechanism of Large Language Models",
    "authors": "Hongbin Zhang, Kehai Chen, Xuefeng Bai, Xiucheng Li, Min Zhang",
    "summary": "Large language models (LLMs) have succeeded remarkably in multilingual\ntranslation tasks. However, the inherent translation mechanisms of LLMs remain\npoorly understood, largely due to sophisticated architectures and vast\nparameter scales. In response to this issue, this study explores the\ntranslation mechanism of LLM from the perspective of computational components\n(e.g., attention heads and MLPs). Path patching is utilized to explore causal\nrelationships between components, detecting those crucial for translation tasks\nand subsequently analyzing their behavioral patterns in human-interpretable\nterms. Comprehensive analysis reveals that translation is predominantly\nfacilitated by a sparse subset of specialized attention heads (less than 5\\%),\nwhich extract source language, indicator, and positional features. MLPs\nsubsequently integrate and process these features by transiting towards\nEnglish-centric latent representations. Notably, building on the above\nfindings, targeted fine-tuning of only 64 heads achieves translation\nimprovement comparable to full-parameter tuning while preserving general\ncapabilities.",
    "published": "2025-02-17T13:50:29Z",
    "pdf_link": "http://arxiv.org/pdf/2502.11806v1"
  },
  {
    "title": "Causal Inference for Qualitative Outcomes",
    "authors": "Riccardo Di Francesco, Giovanni Mellace",
    "summary": "Causal inference methods such as instrumental variables, regression\ndiscontinuity, and difference-in-differences are widely used to estimate\ntreatment effects. However, their application to qualitative outcomes poses\nfundamental challenges, as standard causal estimands are ill-defined in this\ncontext. This paper highlights these issues and introduces an alternative\nframework that focuses on well-defined and interpretable estimands that\nquantify how treatment affects the probability distribution over outcome\ncategories. We establish that standard identification assumptions are\nsufficient for identification and propose simple, intuitive estimation\nstrategies that remain fully compatible with conventional econometric methods.\nTo facilitate implementation, we provide an open-source R package,\n$\\texttt{causalQual}$, which is publicly available on GitHub.",
    "published": "2025-02-17T11:29:33Z",
    "pdf_link": "http://arxiv.org/pdf/2502.11691v1"
  },
  {
    "title": "Open orbits in causal flag manifolds, modular flows and wedge regions",
    "authors": "Karl-Hermann Neeb",
    "summary": "We study open orbits of symmetric subgroups of a simple connected\n  Lie group G on a causal flag manifold.\n  First we show that a flag manifold M of G carries an invariant causal\nstructure if and only if G is hermitian\n  of tube type and M is the conformal completion\n  of the corresponding simple euclidean Jordan algebra,\n  resp., the Shilov boundary of the associated symmetric tube domain.\n  We then study open orbits in M under symmetric subgroups,\n  also called causal\n  Makarevic spaces, from the perspective of applications in Algebraic Quantum\nField Theory (AQFT). A key motivation is the geometry of corresponding modular\nflows.\n  The open orbits are reductive causal symmetric\n  spaces, which arise in two flavors:\n  compactly causal and non-compactly causal ones.\n  In the non-compactly causal case we determine the corresponding Euler\nelements\n  and their positivity regions. For compactly causal spaces,\n  modular flows do not always exist and we determine\n  when this is the case. Then the positivity regions of the modular flows are\nnot globally hyperbolic,\n  but these spaces contain other interesting\n  globally hyperbolic subsets that can be described\n  in terms of the conformally flat Jordan coordinates via Cayley charts.\n  We discuss the Lorentzian case, involving de Sitter\n  and anti-de Sitter space in some detail.",
    "published": "2025-02-17T10:24:49Z",
    "pdf_link": "http://arxiv.org/pdf/2502.11635v1"
  }
]