[
  {
    "title": "MLLMs Know Where to Look: Training-free Perception of Small Visual\n  Details with Multimodal LLMs",
    "authors": "Jiarui Zhang, Mahyar Khayatkhoei, Prateek Chhikara, Filip Ilievski",
    "summary": "Multimodal Large Language Models (MLLMs) have experienced rapid progress in\nvisual recognition tasks in recent years. Given their potential integration\ninto many critical applications, it is important to understand the limitations\nof their visual perception. In this work, we study whether MLLMs can perceive\nsmall visual details as effectively as large ones when answering questions\nabout images. We observe that their performance is very sensitive to the size\nof the visual subject of the question, and further show that this effect is in\nfact causal by conducting an intervention study. Next, we study the attention\npatterns of MLLMs when answering visual questions, and intriguingly find that\nthey consistently know where to look, even when they provide the wrong answer.\nBased on these findings, we then propose training-free visual intervention\nmethods that leverage the internal knowledge of any MLLM itself, in the form of\nattention and gradient maps, to enhance its perception of small visual details.\nWe evaluate our proposed methods on two widely-used MLLMs and seven visual\nquestion answering benchmarks and show that they can significantly improve\nMLLMs' accuracy without requiring any training. Our results elucidate the risk\nof applying MLLMs to visual recognition tasks concerning small details and\nindicate that visual intervention using the model's internal state is a\npromising direction to mitigate this risk.",
    "published": "2025-02-24T18:54:40Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17422v1"
  },
  {
    "title": "Sustainable Greenhouse Management: A Comparative Analysis of Recurrent\n  and Graph Neural Networks",
    "authors": "Emiliano Seri, Marcello Petitta, Cristina Cornaro",
    "summary": "The integration of photovoltaic (PV) systems into greenhouses not only\noptimizes land use but also enhances sustainable agricultural practices by\nenabling dual benefits of food production and renewable energy generation.\nHowever, accurate prediction of internal environmental conditions is crucial to\nensure optimal crop growth while maximizing energy production. This study\nintroduces a novel application of Spatio-Temporal Graph Neural Networks\n(STGNNs) to greenhouse microclimate modeling, comparing their performance with\ntraditional Recurrent Neural Networks (RNNs). While RNNs excel at temporal\npattern recognition, they cannot explicitly model the directional relationships\nbetween environmental variables. Our STGNN approach addresses this limitation\nby representing these relationships as directed graphs, enabling the model to\ncapture both spatial dependencies and their directionality. Using\nhigh-frequency data collected at 15-minute intervals from a greenhouse in\nVolos, Greece, we demonstrate that RNNs achieve exceptional accuracy in winter\nconditions (R^2 = 0.985) but show limitations during summer cooling system\noperation. Though STGNNs currently show lower performance (winter R^2 = 0.947),\ntheir architecture offers greater potential for integrating additional\nvariables such as PV generation and crop growth indicators.",
    "published": "2025-02-24T17:52:01Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17371v1"
  },
  {
    "title": "Joint Value Estimation and Bidding in Repeated First-Price Auctions",
    "authors": "Yuxiao Wen, Yanjun Han, Zhengyuan Zhou",
    "summary": "We study regret minimization in repeated first-price auctions (FPAs), where a\nbidder observes only the realized outcome after each auction -- win or loss.\nThis setup reflects practical scenarios in online display advertising where the\nactual value of an impression depends on the difference between two potential\noutcomes, such as clicks or conversion rates, when the auction is won versus\nlost. We analyze three outcome models: (1) adversarial outcomes without\nfeatures, (2) linear potential outcomes with features, and (3) linear treatment\neffects in features. For each setting, we propose algorithms that jointly\nestimate private values and optimize bidding strategies, achieving near-optimal\nregret bounds. Notably, our framework enjoys a unique feature that the\ntreatments are also actively chosen, and hence eliminates the need for the\noverlap condition commonly required in causal inference.",
    "published": "2025-02-24T16:21:50Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17292v1"
  },
  {
    "title": "IGDA: Interactive Graph Discovery through Large Language Model Agents",
    "authors": "Alex Havrilla, David Alvarez-Melis, Nicolo Fusi",
    "summary": "Large language models ($\\textbf{LLMs}$) have emerged as a powerful method for\ndiscovery. Instead of utilizing numerical data, LLMs utilize associated\nvariable $\\textit{semantic metadata}$ to predict variable relationships.\nSimultaneously, LLMs demonstrate impressive abilities to act as black-box\noptimizers when given an objective $f$ and sequence of trials. We study LLMs at\nthe intersection of these two capabilities by applying LLMs to the task of\n$\\textit{interactive graph discovery}$: given a ground truth graph $G^*$\ncapturing variable relationships and a budget of $I$ edge experiments over $R$\nrounds, minimize the distance between the predicted graph $\\hat{G}_R$ and $G^*$\nat the end of the $R$-th round. To solve this task we propose $\\textbf{IGDA}$,\na LLM-based pipeline incorporating two key components: 1) an LLM\nuncertainty-driven method for edge experiment selection 2) a local graph update\nstrategy utilizing binary feedback from experiments to improve predictions for\nunselected neighboring edges. Experiments on eight different real-world graphs\nshow our approach often outperforms all baselines including a state-of-the-art\nnumerical method for interactive graph discovery. Further, we conduct a\nrigorous series of ablations dissecting the impact of each pipeline component.\nFinally, to assess the impact of memorization, we apply our interactive graph\ndiscovery strategy to a complex, new (as of July 2024) causal graph on protein\ntranscription factors, finding strong performance in a setting where\nmemorization is impossible. Overall, our results show IGDA to be a powerful\nmethod for graph discovery complementary to existing numerically driven\napproaches.",
    "published": "2025-02-24T14:24:27Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17189v1"
  },
  {
    "title": "Teleology-Driven Affective Computing: A Causal Framework for Sustained\n  Well-Being",
    "authors": "Bin Yin, Chong-Yi Liu, Liya Fu, Jinkun Zhang",
    "summary": "Affective computing has made significant strides in emotion recognition and\ngeneration, yet current approaches mainly focus on short-term pattern\nrecognition and lack a comprehensive framework to guide affective agents toward\nlong-term human well-being. To address this, we propose a teleology-driven\naffective computing framework that unifies major emotion theories (basic\nemotion, appraisal, and constructivist approaches) under the premise that\naffect is an adaptive, goal-directed process that facilitates survival and\ndevelopment. Our framework emphasizes aligning agent responses with both\npersonal/individual and group/collective well-being over extended timescales.\nWe advocate for creating a \"dataverse\" of personal affective events, capturing\nthe interplay between beliefs, goals, actions, and outcomes through real-world\nexperience sampling and immersive virtual reality. By leveraging causal\nmodeling, this \"dataverse\" enables AI systems to infer individuals' unique\naffective concerns and provide tailored interventions for sustained well-being.\nAdditionally, we introduce a meta-reinforcement learning paradigm to train\nagents in simulated environments, allowing them to adapt to evolving affective\nconcerns and balance hierarchical goals - from immediate emotional needs to\nlong-term self-actualization. This framework shifts the focus from statistical\ncorrelations to causal reasoning, enhancing agents' ability to predict and\nrespond proactively to emotional challenges, and offers a foundation for\ndeveloping personalized, ethically aligned affective systems that promote\nmeaningful human-AI interactions and societal well-being.",
    "published": "2025-02-24T14:07:53Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17172v1"
  },
  {
    "title": "Applications of Large Models in Medicine",
    "authors": "YunHe Su, Zhengyang Lu, Junhui Liu, Ke Pang, Haoran Dai, Sa Liu Yuxin Jia, Lujia Ge, Jing-min Yang",
    "summary": "This paper explores the advancements and applications of large-scale models\nin the medical field, with a particular focus on Medical Large Models (MedLMs).\nThese models, encompassing Large Language Models (LLMs), Vision Models, 3D\nLarge Models, and Multimodal Models, are revolutionizing healthcare by\nenhancing disease prediction, diagnostic assistance, personalized treatment\nplanning, and drug discovery. The integration of graph neural networks in\nmedical knowledge graphs and drug discovery highlights the potential of Large\nGraph Models (LGMs) in understanding complex biomedical relationships. The\nstudy also emphasizes the transformative role of Vision-Language Models (VLMs)\nand 3D Large Models in medical image analysis, anatomical modeling, and\nprosthetic design. Despite the challenges, these technologies are setting new\nbenchmarks in medical innovation, improving diagnostic accuracy, and paving the\nway for personalized healthcare solutions. This paper aims to provide a\ncomprehensive overview of the current state and future directions of large\nmodels in medicine, underscoring their significance in advancing global health.",
    "published": "2025-02-24T13:21:30Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17132v1"
  },
  {
    "title": "A Multipole-Based Framework for Kerr Black Hole Mimickers: From General\n  Construction to a Specific Case of Study",
    "authors": "Claudio Gambino",
    "summary": "We present a novel framework for constructing solutions to the Einstein\nequations with an arbitrary multipolar structure, providing a systematic method\nto identify physically reasonable energy-momentum tensors that source black\nhole mimickers. As an example, we investigate an anisotropic fluid with a\ngaussian-like energy-density profile that, at linearized level, satisfies all\nenergy and causality conditions while producing a gravitational field with the\nexact same multipolar structure as Kerr black holes. In the spinless case, we\nobtain a fully non-perturbative solution that, depending on the parameter\nchoices, describes either a horizonless Schwarzschild mimicker or a static\nregular black hole model with a resolved curvature singularity.",
    "published": "2025-02-24T10:31:21Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17032v1"
  },
  {
    "title": "Your Assumed DAG is Wrong and Here's How To Deal With It",
    "authors": "Kirtan Padh, Zhufeng Li, Cecilia Casolo, Niki Kilbertus",
    "summary": "Assuming a directed acyclic graph (DAG) that represents prior knowledge of\ncausal relationships between variables is a common starting point for\ncause-effect estimation. Existing literature typically invokes hypothetical\ndomain expert knowledge or causal discovery algorithms to justify this\nassumption. In practice, neither may propose a single DAG with high confidence.\nDomain experts are hesitant to rule out dependencies with certainty or have\nongoing disputes about relationships; causal discovery often relies on\nuntestable assumptions itself or only provides an equivalence class of DAGs and\nis commonly sensitive to hyperparameter and threshold choices. We propose an\nefficient, gradient-based optimization method that provides bounds for causal\nqueries over a collection of causal graphs -- compatible with imperfect prior\nknowledge -- that may still be too large for exhaustive enumeration. Our bounds\nachieve good coverage and sharpness for causal queries such as average\ntreatment effects in linear and non-linear synthetic settings as well as on\nreal-world data. Our approach aims at providing an easy-to-use and widely\napplicable rebuttal to the valid critique of `What if your assumed DAG is\nwrong?'.",
    "published": "2025-02-24T10:31:12Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17030v1"
  },
  {
    "title": "Predicting Liquidity-Aware Bond Yields using Causal GANs and Deep\n  Reinforcement Learning with LLM Evaluation",
    "authors": "Jaskaran Singh Walia, Aarush Sinha, Srinitish Srinivasan, Srihari Unnikrishnan",
    "summary": "Financial bond yield forecasting is challenging due to data scarcity,\nnonlinear macroeconomic dependencies, and evolving market conditions. In this\npaper, we propose a novel framework that leverages Causal Generative\nAdversarial Networks (CausalGANs) and Soft Actor-Critic (SAC) reinforcement\nlearning (RL) to generate high-fidelity synthetic bond yield data for four\nmajor bond categories (AAA, BAA, US10Y, Junk). By incorporating 12 key\nmacroeconomic variables, we ensure statistical fidelity by preserving essential\nmarket properties. To transform this market dependent synthetic data into\nactionable insights, we employ a finetuned Large Language Model (LLM)\nQwen2.5-7B that generates trading signals (BUY/HOLD/SELL), risk assessments,\nand volatility projections. We use automated, human and LLM evaluations, all of\nwhich demonstrate that our framework improves forecasting performance over\nexisting methods, with statistical validation via predictive accuracy, MAE\nevaluation(0.103%), profit/loss evaluation (60% profit rate), LLM evaluation\n(3.37/5) and expert assessments scoring 4.67 out of 5. The reinforcement\nlearning-enhanced synthetic data generation achieves the least Mean Absolute\nError of 0.103, demonstrating its effectiveness in replicating real-world bond\nmarket dynamics. We not only enhance data-driven trading strategies but also\nprovides a scalable, high-fidelity synthetic financial data pipeline for risk &\nvolatility management and investment decision-making. This work establishes a\nbridge between synthetic data generation, LLM driven financial forecasting, and\nlanguage model evaluation, contributing to AI-driven financial decision-making.",
    "published": "2025-02-24T09:46:37Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17011v1"
  },
  {
    "title": "A tutorial on optimal dynamic treatment regimes",
    "authors": "Chunyu Wang, Brian DM Tom",
    "summary": "A dynamic treatment regime is a sequence of treatment decision rules tailored\nto an individual's evolving status over time. In precision medicine, much focus\nhas been placed on finding an optimal dynamic treatment regime which, if\nfollowed by everyone in the population, would yield the best outcome on\naverage; and extensive investigation has been conducted from both\nmethodological and applications standpoints. The aim of this tutorial is to\nprovide readers who are interested in optimal dynamic treatment regimes with a\nsystematic, detailed but accessible introduction, including the formal\ndefinition and formulation of this topic within the framework of causal\ninference, identification assumptions required to link the causal quantity of\ninterest to the observed data, existing statistical models and estimation\nmethods to learn the optimal regime from data, and application of these methods\nto both simulated and real data.",
    "published": "2025-02-24T09:24:51Z",
    "pdf_link": "http://arxiv.org/pdf/2502.16988v1"
  }
]