[
  {
    "title": "Enhancing DNA Foundation Models to Address Masking Inefficiencies",
    "authors": "Monireh Safari, Pablo Millan Arias, Scott C. Lowe, Lila Kari, Angel X. Chang, Graham W. Taylor",
    "summary": "Masked language modelling (MLM) as a pretraining objective has been widely\nadopted in genomic sequence modelling. While pretrained models can successfully\nserve as encoders for various downstream tasks, the distribution shift between\npretraining and inference detrimentally impacts performance, as the pretraining\ntask is to map [MASK] tokens to predictions, yet the [MASK] is absent during\ndownstream applications. This means the encoder does not prioritize its\nencodings of non-[MASK] tokens, and expends parameters and compute on work only\nrelevant to the MLM task, despite this being irrelevant at deployment time. In\nthis work, we propose a modified encoder-decoder architecture based on the\nmasked autoencoder framework, designed to address this inefficiency within a\nBERT-based transformer. We empirically show that the resulting mismatch is\nparticularly detrimental in genomic pipelines where models are often used for\nfeature extraction without fine-tuning. We evaluate our approach on the\nBIOSCAN-5M dataset, comprising over 2 million unique DNA barcodes. We achieve\nsubstantial performance gains in both closed-world and open-world\nclassification tasks when compared against causal models and bidirectional\narchitectures pretrained with MLM tasks.",
    "published": "2025-02-25T17:56:25Z",
    "pdf_link": "http://arxiv.org/pdf/2502.18405v1"
  },
  {
    "title": "Causal AI-based Root Cause Identification: Research to Practice at Scale",
    "authors": "Saurabh Jha, Ameet Rahane, Laura Shwartz, Marc Palaci-Olgun, Frank Bagehorn, Jesus Rios, Dan Stingaciu, Ragu Kattinakere, Debasish Banerjee",
    "summary": "Modern applications are built as large, distributed systems spanning numerous\nmodules, teams, and data centers. Despite robust engineering and recovery\nstrategies, failures and performance issues remain inevitable, risking\nsignificant disruptions and affecting end users. Rapid and accurate root cause\nidentification is therefore vital to ensure system reliability and maintain key\nservice metrics.\n  We have developed a novel causality-based Root Cause Identification (RCI)\nalgorithm that emphasizes causation over correlation. This algorithm has been\nintegrated into IBM Instana-bridging research to practice at scale-and is now\nin production use by enterprise customers. By leveraging \"causal AI,\" Instana\nstands apart from typical Application Performance Management (APM) tools,\npinpointing issues in near real-time. This paper highlights Instana's advanced\nfailure diagnosis capabilities, discussing both the theoretical underpinnings\nand practical implementations of the RCI algorithm. Real-world examples\nillustrate how our causality-based approach enhances reliability and\nperformance in today's complex system landscapes.",
    "published": "2025-02-25T14:20:33Z",
    "pdf_link": "http://arxiv.org/pdf/2502.18240v1"
  },
  {
    "title": "Unveiling and Causalizing CoT: A Causal Pespective",
    "authors": "Jiarun Fu, Lizhong Ding, Hao Li, Pengqi Li, Qiuning Wei, Xu Chen",
    "summary": "Although Chain-of-Thought (CoT) has achieved remarkable success in enhancing\nthe reasoning ability of large language models (LLMs), the mechanism of CoT\nremains a ``black box''. Even if the correct answers can frequently be\nobtained, existing CoTs struggle to make the reasoning understandable to human.\nIn this paper, we unveil and causalize CoT from a causal perspective to ensure\nboth correctness and understandability of all reasoning steps (to the best of\nour knowledge, the first such). We model causality of CoT via structural causal\nmodels (SCM) to unveil the reasoning mechanism of CoT. To measure the causality\nof CoT, we define the CoT Average Causal Effect (CACE) to test the causal\nrelations between steps. For those steps without causality (wrong or\nunintelligible steps), we design a role-playing causal query algorithm to\ncausalize these steps, resulting a causalized CoT with all steps correct and\nunderstandable. Experimental results on both open-source and closed-source LLMs\ndemonstrate that the causal errors commonly in steps are effectively corrected\nand the reasoning ability of LLMs is significantly improved.",
    "published": "2025-02-25T14:20:27Z",
    "pdf_link": "http://arxiv.org/pdf/2502.18239v1"
  },
  {
    "title": "Experimentally separating vacuum fluctuations from source radiation",
    "authors": "Alexa Herter, Frieder Lindel, Laura Gabriel, Stefan Yoshi Buhmann, Jérôme Faist",
    "summary": "The unique distinction between vacuum-field and source-radiation induced\neffects in processes such as the Lamb shift, Casimir forces or spontaneous\nemission, remains unresolved even at the theoretical level, and an experimental\napproach was never considered feasible [1-4]. In 1932, Fermi introduced the\ntwo-atom problem, which is a Gedanken-experiment that explores how two atoms\ninteract with the surrounding electromagnetic field via vacuum and\nsource-radiation induced processes, providing fundamental insights into the\nbehavior of quantum fields [5-9]. Recent advancements in ultrafast optics have\nenabled experimental analogues of this system using two laser pulses inside a\nnonlinear crystal [10-12]. Here, we demonstrate the detection of vacuum and\nsource radiation induced correlations, separated by their causal properties,\nbetween two laser pulses. In particular, we show that vacuum fluctuations and\nsource radiation correlate different quadratures of near-infrared laser pulses,\nallowing them to be individually probed through phase-sensitive detection. This\nresult provides an experimental verification of the time-domain\nfluctuation-dissipation theorem at the quantum level and offers a novel path to\nstudying quantum radiation effects in time-dependent media. Beyond resolving a\nlongstanding theoretical ambiguity, our findings open new possibilities for\ninvestigating quantum field phenomena in the context of relativistic quantum\ninformation such as entanglement harvesting from the quantum vacuum or quantum\nfield detection in analogues of curved space-times.",
    "published": "2025-02-25T13:51:53Z",
    "pdf_link": "http://arxiv.org/pdf/2502.18208v1"
  },
  {
    "title": "Graph Augmentation for Cross Graph Domain Generalization",
    "authors": "Guanzi Chen, Jiying Zhang, Yang Li",
    "summary": "Cross-graph node classification, utilizing the abundant labeled nodes from\none graph to help classify unlabeled nodes in another graph, can be viewed as a\ndomain generalization problem of graph neural networks (GNNs) due to the\nstructure shift commonly appearing among various graphs. Nevertheless, current\nendeavors for cross-graph node classification mainly focus on model training.\nData augmentation approaches, a simple and easy-to-implement domain\ngeneralization technique, remain under-explored. In this paper, we develop a\nnew graph structure augmentation for the crossgraph domain generalization\nproblem. Specifically, low-weight edgedropping is applied to remove potential\nnoise edges that may hinder the generalization ability of GNNs, stimulating the\nGNNs to capture the essential invariant information underlying different\nstructures. Meanwhile, clustering-based edge-adding is proposed to generate\ninvariant structures based on the node features from the same distribution.\nConsequently, with these augmentation techniques, the GNNs can maintain the\ndomain invariant structure information that can improve the generalization\nability. The experiments on out-ofdistribution citation network datasets verify\nour method achieves state-of-the-art performance among conventional\naugmentations.",
    "published": "2025-02-25T13:27:48Z",
    "pdf_link": "http://arxiv.org/pdf/2502.18188v1"
  },
  {
    "title": "ExPath: Towards Explaining Targeted Pathways for Biological Knowledge\n  Bases",
    "authors": "Rikuto Kotoge, Ziwei Yang, Zheng Chen, Yushun Dong, Yasuko Matsubara, Jimeng Sun, Yasushi Sakurai",
    "summary": "Biological knowledge bases provide systemically functional pathways of cells\nor organisms in terms of molecular interaction. However, recognizing more\ntargeted pathways, particularly when incorporating wet-lab experimental data,\nremains challenging and typically requires downstream biological analyses and\nexpertise. In this paper, we frame this challenge as a solvable graph learning\nand explaining task and propose a novel pathway inference framework, ExPath,\nthat explicitly integrates experimental data, specifically amino acid sequences\n(AA-seqs), to classify various graphs (bio-networks) in biological databases.\nThe links (representing pathways) that contribute more to classification can be\nconsidered as targeted pathways. Technically, ExPath comprises three\ncomponents: (1) a large protein language model (pLM) that encodes and embeds\nAA-seqs into graph, overcoming traditional obstacles in processing AA-seq data,\nsuch as BLAST; (2) PathMamba, a hybrid architecture combining graph neural\nnetworks (GNNs) with state-space sequence modeling (Mamba) to capture both\nlocal interactions and global pathway-level dependencies; and (3)\nPathExplainer, a subgraph learning module that identifies functionally critical\nnodes and edges through trainable pathway masks. We also propose ML-oriented\nbiological evaluations and a new metric. The experiments involving 301\nbio-networks evaluations demonstrate that pathways inferred by ExPath maintain\nbiological meaningfulness. We will publicly release curated 301 bio-network\ndata soon.",
    "published": "2025-02-25T09:33:15Z",
    "pdf_link": "http://arxiv.org/pdf/2502.18026v1"
  },
  {
    "title": "GNN-XAR: A Graph Neural Network for Explainable Activity Recognition in\n  Smart Homes",
    "authors": "Michele Fiori, Davide Mor, Gabriele Civitarese, Claudio Bettini",
    "summary": "Sensor-based Human Activity Recognition (HAR) in smart home environments is\ncrucial for several applications, especially in the healthcare domain. The\nmajority of the existing approaches leverage deep learning models. While these\napproaches are effective, the rationale behind their outputs is opaque.\nRecently, eXplainable Artificial Intelligence (XAI) approaches emerged to\nprovide intuitive explanations to the output of HAR models. To the best of our\nknowledge, these approaches leverage classic deep models like CNNs or RNNs.\nRecently, Graph Neural Networks (GNNs) proved to be effective for sensor-based\nHAR. However, existing approaches are not designed with explainability in mind.\nIn this work, we propose the first explainable Graph Neural Network explicitly\ndesigned for smart home HAR. Our results on two public datasets show that this\napproach provides better explanations than state-of-the-art methods while also\nslightly improving the recognition rate.",
    "published": "2025-02-25T09:05:13Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17999v1"
  },
  {
    "title": "A graph neural network-based multispectral-view learning model for\n  diabetic macular ischemia detection from color fundus photographs",
    "authors": "Qinghua He, Hongyang Jiang, Danqi Fang, Dawei Yang, Truong X. Nguyen, Anran Ran, Clement C. Tham, Simon K. H. Szeto, Sobha Sivaprasad, Carol Y. Cheung",
    "summary": "Diabetic macular ischemia (DMI), marked by the loss of retinal capillaries in\nthe macular area, contributes to vision impairment in patients with diabetes.\nAlthough color fundus photographs (CFPs), combined with artificial intelligence\n(AI), have been extensively applied in detecting various eye diseases,\nincluding diabetic retinopathy (DR), their applications in detecting DMI remain\nunexplored, partly due to skepticism among ophthalmologists regarding its\nfeasibility. In this study, we propose a graph neural network-based\nmultispectral view learning (GNN-MSVL) model designed to detect DMI from CFPs.\nThe model leverages higher spectral resolution to capture subtle changes in\nfundus reflectance caused by ischemic tissue, enhancing sensitivity to\nDMI-related features. The proposed approach begins with computational\nmultispectral imaging (CMI) to reconstruct 24-wavelength multispectral fundus\nimages from CFPs. ResNeXt101 is employed as the backbone for multi-view\nlearning to extract features from the reconstructed images. Additionally, a GNN\nwith a customized jumper connection strategy is designed to enhance\ncross-spectral relationships, facilitating comprehensive and efficient\nmultispectral view learning. The study included a total of 1,078\nmacula-centered CFPs from 1,078 eyes of 592 patients with diabetes, of which\n530 CFPs from 530 eyes of 300 patients were diagnosed with DMI. The model\nachieved an accuracy of 84.7 percent and an area under the receiver operating\ncharacteristic curve (AUROC) of 0.900 (95 percent CI: 0.852-0.937) on\neye-level, outperforming both the baseline model trained from CFPs and human\nexperts (p-values less than 0.01). These findings suggest that AI-based CFP\nanalysis holds promise for detecting DMI, contributing to its early and\nlow-cost screening.",
    "published": "2025-02-25T06:17:20Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17886v1"
  },
  {
    "title": "Neural Graph Matching Improves Retrieval Augmented Generation in\n  Molecular Machine Learning",
    "authors": "Runzhong Wang, Rui-Xi Wang, Mrunali Manjrekar, Connor W. Coley",
    "summary": "Molecular machine learning has gained popularity with the advancements of\ngeometric deep learning. In parallel, retrieval-augmented generation has become\na principled approach commonly used with language models. However, the optimal\nintegration of retrieval augmentation into molecular machine learning remains\nunclear. Graph neural networks stand to benefit from clever matching to\nunderstand the structural alignment of retrieved molecules to a query molecule.\nNeural graph matching offers a compelling solution by explicitly modeling node\nand edge affinities between two structural graphs while employing a\nnoise-robust, end-to-end neural network to learn affinity metrics. We apply\nthis approach to mass spectrum simulation and introduce MARASON, a novel model\nthat incorporates neural graph matching to enhance a fragmentation-based neural\nnetwork. Experimental results highlight the effectiveness of our design, with\nMARASON achieving 28% top-1 accuracy, a substantial improvement over the\nnon-retrieval state-of-the-art accuracy of 19%. Moreover, MARASON outperforms\nboth naive retrieval-augmented generation methods and traditional graph\nmatching approaches.",
    "published": "2025-02-25T05:59:14Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17874v1"
  },
  {
    "title": "Armada: Memory-Efficient Distributed Training of Large-Scale Graph\n  Neural Networks",
    "authors": "Roger Waleffe, Devesh Sarda, Jason Mohoney, Emmanouil-Vasileios Vlatakis-Gkaragkounis, Theodoros Rekatsinas, Shivaram Venkataraman",
    "summary": "We study distributed training of Graph Neural Networks (GNNs) on\nbillion-scale graphs that are partitioned across machines. Efficient training\nin this setting relies on min-edge-cut partitioning algorithms, which minimize\ncross-machine communication due to GNN neighborhood sampling. Yet, min-edge-cut\npartitioning over large graphs remains a challenge: State-of-the-art (SoTA)\noffline methods (e.g., METIS) are effective, but they require orders of\nmagnitude more memory and runtime than GNN training itself, while\ncomputationally efficient algorithms (e.g., streaming greedy approaches) suffer\nfrom increased edge cuts. Thus, in this work we introduce Armada, a new\nend-to-end system for distributed GNN training whose key contribution is GREM,\na novel min-edge-cut partitioning algorithm that can efficiently scale to large\ngraphs. GREM builds on streaming greedy approaches with one key addition: prior\nvertex assignments are continuously refined during streaming, rather than\nfrozen after an initial greedy selection. Our theoretical analysis and\nexperimental results show that this refinement is critical to minimizing edge\ncuts and enables GREM to reach partition quality comparable to METIS but with\n8-65x less memory and 8-46x faster. Given a partitioned graph, Armada leverages\na new disaggregated architecture for distributed GNN training to further\nimprove efficiency; we find that on common cloud machines, even with zero\ncommunication, GNN neighborhood sampling and feature loading bottleneck\ntraining. Disaggregation allows Armada to independently allocate resources for\nthese operations and ensure that expensive GPUs remain saturated with\ncomputation. We evaluate Armada against SoTA systems for distributed GNN\ntraining and find that the disaggregated architecture leads to runtime\nimprovements up to 4.5x and cost reductions up to 3.1x.",
    "published": "2025-02-25T04:47:39Z",
    "pdf_link": "http://arxiv.org/pdf/2502.17846v1"
  }
]